app/views/product_families/show.html.slim

SELECT "products".* FROM "products" WHERE "products"."product_family_id" = 339449
SELECT COUNT(*) FROM "products" WHERE "products"."product_family_id" = 339449
---
h2 Products
- if @product_family.products.empty?