app/views/customers/show.html.slim

h2 Subscrptions
- if @customer.subscriptions.empty?
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."customer_id" = 2754978
SELECT COUNT(*) FROM "subscriptions" WHERE "subscriptions"."customer_id" = 2754978