app/views/subscriptions/edit.html.slim

SELECT "products".* FROM "products" WHERE "products"."product_family_id" = 339449
---
|  which has the following possible Products:
- @subscription.product.product_family.products.each do |product|