app/controllers/product_families_controller.rb

SELECT "product_families".* FROM "product_families" WHERE "product_families"."id" = ? LIMIT 1  [["id", "339449"]]
---
  def show
    @product_family = ProductFamily.find(params[:id])