app/controllers/subscriptions_controller.rb

  def migrate
    @subscription = Subscription.find(params[:id]).migrate(params[:to_product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "3285398"]]
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "2862629"]]

  def cancel
    @subscription = Subscription.find(params[:id]).cancel
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "2862629"]]

  def reactivate
    @subscription = Subscription.find(params[:id]).reactivate
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "2862629"]]

  def show
    @subscription = Subscription.find(params[:id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "2862629"]]

  def edit
    @subscription = Subscription.find(params[:id])
---
SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."id" = ? LIMIT 1  [["id", "2862629"]]